In [13]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [14]:
df = pd.read_csv("hiring_linear_reg_multi_variable_data.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

<h1> Changes in the Code </h1>
1. importing math module <br>
2. variable floor_merdian is used to make merdian value into integer <br>
3. df["test_score(out of 10)"].median()  is a to get median using median() function<br>

In [18]:
import math 
floor_median =math.floor( df["test_score(out of 10)"].median())
floor_median

8

<h1> Changes in the Code </h1>
1.df['test_score(out of 10)']  is a series(column)that is selected<br>
2.fillna()  is a function used for filling the empty spaces in the series/column<br>
3.floor_merdian is used in the function to fill its value<br>

In [21]:

df['test_score(out of 10)'].fillna(floor_median)

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score(out of 10), dtype: float64

<h1> Code </h1>
the changes are now permanently implimented in the Dataframe using <b>df['test_score(out of 10)']</b><br><br>
<h>  note - This is the part of Cleaning Data <br>
Cleaning and Preprocesssing Data is very important </h>

In [23]:
df['test_score(out of 10)'] =df['test_score(out of 10)'].fillna(floor_median)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

Similarly cleaning the other Given Data

Installing word2number<br>
it converts word into integer

In [ ]:
from word2number import w2n
import pandas as pd
import numpy as np

def safe_word_to_num(x):
    if pd.isna(x):  # Check for actual NaN
        return np.nan
    if isinstance(x, str) and x.lower() == 'nan':  # Check for string "nan"
        return np.nan
    try:
        return w2n.word_to_num(x)
    except:
        return np.nan  # Return NaN if conversion fails

df['experience'] = df['experience'].apply(safe_word_to_num)

<h>Getting Median<h>

In [ ]:
import math 
df['experience'].median()
floor_median_exp = math.floor(df['experience'].median())
floor_median_exp

6

<h>filling up the empty spaces<h>

In [ ]:
df['experience'].fillna(floor_median_exp)

0     6.0
1     6.0
2     5.0
3     2.0
4     7.0
5     3.0
6    10.0
7    11.0
Name: experience, dtype: float64

Adding changes to dataframe

In [ ]:
df['experience'] =df['experience'].fillna(floor_median_exp)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         6.0                    8.0                           9      50000
1         6.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000